Tekla Open API Reference for Tekla Structures 2025
PourObject.PourAttributes Constructor
 Creates a new default pour attributes instance that loads standard attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PourAttributes()
Public Sub New
See Also
Reference
PourObject.PourAttributes Class
PourObject.PourAttributes Overload
Tekla.Structures.Drawing Namespace